Revit 2026 API

# ProjectInfoNumber Property

---

Get or Set the Project Number of the Project Information.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Number { get; set; }
```
```vb
Public Property Number As String
	Get
	Set
```
```cpp
public:
property String^ Number {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Number : string with get, set
```

#### Property Value

String

This property is used to get or set the Project Number of the Project Information.

#### Reference

ProjectInfo Class

Autodesk.Revit.DB Namespace